package step.learning.async;

public class AsyncDemo {
    public void run() {
        System.out.println("Demo starts");
        // new MultiThread().demo();
        new MultiTask().demo();
        System.out.println("Demo finishes");
    }
}
/*
Асинхронне програмування
Синхронне виконання задач (коду) - послідовне у часі
----1---- ===2=== +++++++3++++++
Асинхронність - будь-яке відхилення від синхронності:
 * паралельність
        ----1----
        ===2===
        +++++++3++++++
 * часткова паралельність
        ----1---- ===2===
        +++++++3++++++
 * імітована паралельність
        - - - - 1 - - - - = = = 2 = ==
         + + + + + + + 3 + + + + + +

Реалізації асинхронності
 - багатозадачність: використання об'єктів рівня мови програмування/платформи (Task, Promise, Future,...)
 - багатопоточність: використання об'єктів рівня ОС (Thread)
 - багатопроцесність: --------------//------------  (Process)
 - мережні технології: розподіл коду за мережними вузлами
 */
